//Використовуючи Visual Studio, створіть проект за шаблоном ConsoleApplication. 
//    Напишіть програму розрахунку нарахування премій працівникам. 
//    Премії розраховуються згідно з вислугою років. Якщо вислуга віком до 5 років, 
//    премія становить 10% від заробітної плати. 
//    Якщо вислуга від 5 років (включно) до 10 років, то премія становить 15% від 
//    заробітної плати. Якщо вислуга віком від 10 років (включно) до 15 років, 
//    премія становить 25% від заробітної плати. Якщо вислуга віком від 15 років 
//    (включно) до 20 років, премія становить 35% від заробітної плати. 
//    Якщо вислуга віком від 20 років (включно) до 25 років, премія становить 45% 
//    від заробітної плати. Якщо вислуга від 25 років (включно) та більше, премія 
//    складає 50% від заробітної плати. 
//    Результати розрахунку виведіть на екран. 

Console.Write("Ввідіть ставку працівника -> ");
double salary = Convert.ToDouble(Console.ReadLine());
if (salary < 0 || salary == 0)
{
    Console.WriteLine("Некоректне значення ставки працівника. Нажміть будь-яку клавішу.");
    Console.ReadKey();
    return;
}
Console.Write("Ввідіть вислугу років -> ");
int termin = Convert.ToInt32(Console.ReadLine());

if (termin < 0)
{
    Console.WriteLine("Некоректне значення вислуги років. Нажміть будь-яку клавішу.");
    Console.ReadKey();
    return;
}
int procent = 0;

if (termin < 5)
    procent = 10;
if (termin >= 5 && termin < 10)
    procent = 15;
if (termin >= 10 && termin < 15)
    procent = 25;
if (termin >= 15 && termin < 20)
    procent = 35;
if (termin >= 20 && termin < 25)
    procent = 45;
if (termin >= 25)
    procent = 50;

Console.WriteLine("Премія - " + procent + "% = " + (salary * procent / 100));
Console.WriteLine("Зарплата = " + (salary + (salary * procent / 100)));